;; -*- no-byte-compile: t; -*-
;;; packages.el --- EXWM packages for Doom Emacs

;; EXWM and related packages
(package! exwm)
(package! desktop-environment)

;; Audio control
(package! pulseaudio-control)

;; System monitoring
(package! symon)

;; Application launcher
(package! counsel)

;; Window management enhancements
(package! switch-window)

;; Notification support
(package! alert)

;; Terminal emulator (if not using external terminal)
(package! vterm)

;; File manager integration
(package! dired-sidebar)

;; PDF viewer
(package! pdf-tools)

;; Media player control
(package! emms)

;; System information
(package! fancy-battery)

;; Time and date
(package! time)
